# Якщо всі числа в списку позитивні, вам потрібно перевірити,
# чи серед них є паліндромне число (число, яке однаково читається в обох напрямках).
# "True", якщо виконано всі умови завдання. В іншому випадку "False".
# Потрібно використовувати функції all() та any()


if __name__ == '__main__':
    n = int(input())  # Кількість цілих чисел
    numbers = list(map(int, input().split()))  # Список цілих чисел розділений пробілами
    print(all(num > 0 for num in numbers) and any(str(num) == str(num)[::-1] for num in numbers))
